first_routes/app/controllers/artworks_controller.rb

    def index
        #users/:user_id/artworks
        @artworks = Artwork.joins(:artwork_shares).where("artworks.artist_id = #{params[:user_id]} OR artwork_shares.viewer_id = #{params[:user_id]}")
---
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE ("artworks"."artist_id" = $1 OR "artwork_shares"."viewer_id" = $2)  [["artist_id", 7], ["viewer_id", 7]]

    def create
        @artwork = Artwork.new(artwork_params)

        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "another art"], ["image_url", "something.com"], ["artist_id", 6], ["created_at", "2020-04-23 22:18:28.534368"], ["updated_at", "2020-04-23 22:18:28.534368"]]

    def update
        @artwork = Artwork.find(params[:id])

        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "Mona Lisa"], ["image_url", "www.art.com/mona_lisa"], ["artist_id", 1], ["updated_at", "2020-04-23 14:37:53.335490"], ["id", 2]]

    def destroy
        @artwork = Artwork.find(params[:id])
        @artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 9]]