first_routes/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        @artwork_share = ArtworkShare.all

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 11], ["viewer_id", 9], ["created_at", "2020-04-23 22:18:52.036748"], ["updated_at", "2020-04-23 22:18:52.036748"]]
---
    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)

        if @artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]
---
    def destroy
        @artwork_share = ArtworkShare.find(params[:id])
        @artwork_share.destroy