first_routes/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:user_id)
            @comments = Comment.where(user_id: params[:user_id])
        elsif params.has_key?(:artwork_id)
            @comments = Comment.where(artwork_id: params[:artwork_id])
        else
            @comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 7]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 9]]

    def create
        @comment = Comment.new(comment_params)
        if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "This is good!"], ["user_id", 7], ["artwork_id", 9], ["created_at", "2020-04-23 18:08:08.335322"], ["updated_at", "2020-04-23 18:08:08.335322"]]