first_routes/app/controllers/likes_controller.rb

    def index
        if params.has_key?(:user_id)
            @likes = Like.where(user_id: params[:user_id])
        elsif params.has_key?(:likable_id)
            @likes = Like.where(likable_id: params[:likable_id])
        else
            @likes = Like.all
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 4]]

    def create
        @like = Like.new(like_params)
        if @like.save
---
INSERT INTO "likes" ("user_id", "created_at", "updated_at", "likable_id", "likable_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["created_at", "2020-04-23 19:33:55.312104"], ["updated_at", "2020-04-23 19:33:55.312104"], ["likable_id", 8], ["likable_type", "Artwork"]]