first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
   def get_favorite
          @fave = User.find(params[:id]).favorite

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "favorite_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["favorite_id", 11], ["updated_at", "2020-04-23 22:19:39.176643"], ["id", 9]]
---
   def set_favorite
          @user = User.find(params[:id])
          @user.favorite_id = params[:favorite_id]
          if @user.save