first_routes/app/controllers/users_controller.rb

   def create
        @user = User.new(user_params)
        # @user.save!
        if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Andyy"], ["created_at", "2020-04-22 20:25:48.039924"], ["updated_at", "2020-04-22 20:25:48.039924"]]

   def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "123andy@gmail.com"], ["updated_at", "2020-04-22 20:03:46.523802"], ["id", 1]]