first_routes/app/models/user.rb

SELECT COUNT(*) FROM "users" LEFT OUTER JOIN "artworks" ON "artworks"."artist_id" = "users"."id" LEFT OUTER JOIN "artwork_shares" ON "artwork_shares"."viewer_id" = "users"."id" LEFT OUTER JOIN "artworks" "shared_artworks_users" ON "shared_artworks_users"."id" = "artwork_shares"."artwork_id" WHERE (users.id = 9) AND (artworks.id = 7 OR shared_artworks_users.id = 7)
---
    def favorite_must_be_own_or_share
        if favorite_id
            result = User
                .left_outer_joins(:artworks, :shared_artworks)
                .where("users.id = ?", self.id)
                .where("artworks.id = #{favorite_id} OR shared_artworks_users.id = #{favorite_id}")
                .count